{
  "basics": {
    "name": "Alexander Dumanskiy",
    "label": "Engineering Manager",
    "image": "",
    "email": "a.dumanskiy@hotmail.com",
    "phone": "+79219145977",
    "url": "",
    "summary": "Fifteen years in the tech industry sharpening my software development, leadership, and people management skills at market leading companies. Proven track record of defining and delivering exceptional products in dynamic environments while maintaining close stakeholder participation.",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "St.Petersburg",
      "countryCode": "",
      "region": "Russia"
    },
    "profiles": []
  },
  "work": [
    {
      "name": "AnyLogic",
      "position": "Head of AnyLogic 9 & Cloud Development",
      "url": "https://the.anylogic.company",
      "startDate": "2019",
      "endDate": "",
      "summary": "Manage a combined team of 20 developers, QA and DevOps engineers. Defining and perfecting product roadmaps in line with company business strategies.",
      "highlights": [
        "Introduced an inter-project Gantt chart planning system to best deliver goals and a short-cycle feedback to stakeholders",
        "Hired brilliant engineers and consolidated the team to improve development efficiency. Nurtured several developers into teams leaders",
        "Instituted automated CI/CD cycle, bringing development and testing closer to production.",
        "Redefined code quality, infrastructure, and business values of the Anylogic Cloud product, greatly improving customer acknowledgment and market success."
      ]
    },
    {
      "name": "DELL EMC",
      "position": "Senior Software Engineer",
      "url": "https://www.dell.com",
      "startDate": "2013",
      "endDate": "2019",
      "summary": "Performed Services development and architecture design of a distributed data storage system in Java and C++, including high-load performance-oriented block level network IO service.",
      "highlights": [
        "Worked with Linux kernel in matters of block IO, networking, and security. Delivered simple patches for the file system driver.",
        "Supported a low-level service in C, working with hard drives via SATA and SMART to mitigate disk health issues.",
        "Maintained two internal Linux distributions – created services, packages, managed configuration, installation, recovery, etc.",
        "Solved a huge amount of customer escalations working on-call shifts in collaboration with Support team.",
        "Created and co-authored multiple software patents."
      ]
    },
    {
      "name": "JSCB Ruscobank",
      "position": "Head of System Administration Team",
      "url": "http://ruscobank.ru",
      "startDate": "2006",
      "endDate": "2013",
      "summary": "",
      "highlights": [
        "Built a comprehensive tech stack from scratch, including internal banking software, databases, and a huge variety of infrastructure services with a backbone built solely on Linux.",
        "Implemented an inexpensive and redundant HA virtualization cluster solution.",
        "Developed a terminal server for thin client workstations focused on cost-efficiency and security.",
        "Raised a team of System Engineers, polished internal work processes – user access management, system administration, backup and disaster recovery.",
        "Minimized downtime of all services, crafted a state-of-art solution that worked flawlessly for many years and passed multiple government audits."
      ]
    }
  ],
  "volunteer": [],
  "education": [
    {
      "institution": "University of Management Technologies and Economics",
      "url": "https://en.spbume.ru/en/",
      "area": "Finance and Credit",
      "studyType": "Specialist",
      "startDate": "",
      "endDate": "2009",
      "score": "",
      "courses": []
    }
  ],
  "awards": [],
  "certificates": [],
  "publications": [],
  "skills": [
    {
      "name": "Leadership",
      "level": "",
      "keywords": [
        "Lead and nurture teams",
        "Work in diverse teams across the globe",
        "Hire engineers and conduct job interviews"
      ]
    },
    {
      "name": "Tech skills",
      "level": "",
      "keywords": [
        "Building distributed systems",
        "JIRA, Confluence, git, CI/CD",
        "Orchestration at scale: Ansible, Puppet, cloud-init",
        "In-depth Linux knowledge: kernel, packages, scripting, network, security, etc",
        "Containerization with Docker, k18s",
        "Java, C++, Python, Bash",
        "Databases: Postgres, Mysql/Mariadb, Oracle",
        "AWS"
      ]
    }
  ],
  "languages": [],
  "interests": [],
  "references": [],
  "projects": []
}
